In [1]:
import pandas as pd
import numpy as np

In [7]:
dict1={'Name':['Ramesh','Suresh','Sathish',np.nan],
       'Age':[30,33,np.nan,36],
       'City':[np.nan,'Hyderabad','Hyderabad','Blr']}

In [11]:
data=pd.DataFrame(dict1)
data

      Name   Age       City
0   Ramesh  30.0        NaN
1   Suresh  33.0  Hyderabad
2  Sathish   NaN  Hyderabad
3      NaN  36.0        Blr

In [13]:
data.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [15]:
data.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

**dropna**

In [ ]:
- Drop the null values data based on rows and columns

In [18]:
data.dropna()

     Name   Age       City
1  Suresh  33.0  Hyderabad

In [20]:
data

      Name   Age       City
0   Ramesh  30.0        NaN
1   Suresh  33.0  Hyderabad
2  Sathish   NaN  Hyderabad
3      NaN  36.0        Blr

In [22]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [30]:
dict1={'Name':['Ramesh','Suresh','Sathish',np.nan],
       'Age':[30,33,np.nan,36],
       'City':[np.nan,'Hyderabad','Hyderabad','Bangalore'],
      'Company':['Google','Microsoft','Apple','Meta']}

data1=pd.DataFrame(dict1)
data1

      Name   Age       City    Company
0   Ramesh  30.0        NaN     Google
1   Suresh  33.0  Hyderabad  Microsoft
2  Sathish   NaN  Hyderabad      Apple
3      NaN  36.0  Bangalore       Meta

In [34]:
data1.dropna(axis=1)

     Company
0     Google
1  Microsoft
2      Apple
3       Meta

**Fillna**

In [39]:
data1.fillna(25)

      Name   Age       City    Company
0   Ramesh  30.0         25     Google
1   Suresh  33.0  Hyderabad  Microsoft
2  Sathish  25.0  Hyderabad      Apple
3       25  36.0  Bangalore       Meta

In [41]:
data1['Name'].fillna('Vinay')

0     Ramesh
1     Suresh
2    Sathish
3      Vinay
Name: Name, dtype: object

In [43]:
data1['Age'].fillna(34)

0    30.0
1    33.0
2    34.0
3    36.0
Name: Age, dtype: float64

In [45]:
data1['City'].fillna('Secunderabad')

0    Secunderabad
1       Hyderabad
2       Hyderabad
3       Bangalore
Name: City, dtype: object

In [ ]:
Drawback: Filling with

- To avoid the we have some methods

    - backfill

    - bfill

    - ffill

    - pad

**backfill**

In [62]:
import warnings
warnings.filterwarnings('ignore')

data1.fillna(method='backfill')

      Name   Age       City    Company
0   Ramesh  30.0  Hyderabad     Google
1   Suresh  33.0  Hyderabad  Microsoft
2  Sathish  36.0  Hyderabad      Apple
3      NaN  36.0  Bangalore       Meta

In [70]:
import warnings
warnings.filterwarnings('ignore')

data1.fillna(method='backfill',axis=1)

      Name        Age       City    Company
0   Ramesh       30.0     Google     Google
1   Suresh       33.0  Hyderabad  Microsoft
2  Sathish  Hyderabad  Hyderabad      Apple
3     36.0       36.0  Bangalore       Meta

**bfill**

In [72]:
import warnings
warnings.filterwarnings('ignore')

data1.fillna(method='bfill')

      Name   Age       City    Company
0   Ramesh  30.0  Hyderabad     Google
1   Suresh  33.0  Hyderabad  Microsoft
2  Sathish  36.0  Hyderabad      Apple
3      NaN  36.0  Bangalore       Meta

In [74]:
import warnings
warnings.filterwarnings('ignore')

data1.fillna(method='bfill',axis=1)

      Name        Age       City    Company
0   Ramesh       30.0     Google     Google
1   Suresh       33.0  Hyderabad  Microsoft
2  Sathish  Hyderabad  Hyderabad      Apple
3     36.0       36.0  Bangalore       Meta

**ffill**

In [77]:
import warnings
warnings.filterwarnings('ignore')

data1.fillna(method='ffill')

      Name   Age       City    Company
0   Ramesh  30.0        NaN     Google
1   Suresh  33.0  Hyderabad  Microsoft
2  Sathish  33.0  Hyderabad      Apple
3  Sathish  36.0  Bangalore       Meta

In [79]:
import warnings
warnings.filterwarnings('ignore')

data1.fillna(method='ffill',axis=1)

      Name      Age       City    Company
0   Ramesh     30.0       30.0     Google
1   Suresh     33.0  Hyderabad  Microsoft
2  Sathish  Sathish  Hyderabad      Apple
3      NaN     36.0  Bangalore       Meta

**pad**

In [67]:
import warnings
warnings.filterwarnings('ignore')

data1.fillna(method='pad')

      Name   Age       City    Company
0   Ramesh  30.0        NaN     Google
1   Suresh  33.0  Hyderabad  Microsoft
2  Sathish  33.0  Hyderabad      Apple
3  Sathish  36.0  Bangalore       Meta

In [81]:
import warnings
warnings.filterwarnings('ignore')

data1.fillna(method='pad',axis=1)

      Name      Age       City    Company
0   Ramesh     30.0       30.0     Google
1   Suresh     33.0  Hyderabad  Microsoft
2  Sathish  Sathish  Hyderabad      Apple
3      NaN     36.0  Bangalore       Meta

- Step-1 : Select the column
- Step-2 : Get the mean
- Step-3 : Apply fillna

In [87]:
age_mean=data1['Age'].mean() #  Select the column
print('age_mean:',age_mean)  # get the mean
data1['Age'].fillna(age_mean) # apply fillna

age_mean: 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [89]:
age_median=data1['Age'].median() #  Select the column
print('age_mean:',age_median)  # get the mean
data1['Age'].fillna(age_median)

age_mean: 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [91]:
city_mode=data1['City'].mode()
city_mode

0    Hyderabad
Name: City, dtype: object

In [93]:
city_mode=data1['City'].mode()
city_mode.values[0]

'Hyderabad'

In [100]:
city_mode=data1['City'].mode()
data['City'].fillna('Hyderabad')

0    Hyderabad
1    Hyderabad
2    Hyderabad
3          Blr
Name: City, dtype: object

**Impute class**

- under sklearn we have impute class is there

-  preprocessing - preprocess

-  missing values - impute

In [96]:
from sklearn import impute

In [98]:
dir(impute)

['KNNImputer',
 'MissingIndicator',
 'SimpleImputer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_base',
 '_knn',
 'typing']

In [104]:
import numpy as np
from sklearn.impute import KNNImputer
X = [[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
imputer = KNNImputer(n_neighbors = 2, weights = 'uniform')
imputer.fit_transform(X)

array([[ 1. ,  2. ,  5. ],
       [ 3. , 31. ,  3. ],
       [ 5.5, 60. ,  5. ],
       [ 8. ,  8. ,  7. ]])

In [108]:
import numpy as np
from sklearn.impute import KNNImputer
X = [[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
imputer = KNNImputer(n_neighbors = 2, weights = 'distance')
imputer.fit_transform(X)

array([[ 1.        ,  2.        ,  3.93905505],
       [ 3.        , 31.        ,  3.        ],
       [ 3.25775362, 60.        ,  5.        ],
       [ 8.        ,  8.        ,  7.        ]])